# Проект FitLife - MVP версия 1.0
# 1. Знакомство
# запрос имени: 
user_name = input("Введите ваше имя: ")
# приветствие
print(f"Привет, {user_name}!")
# запрос возраста и сохранение в переменную user_age с преобразованием в число
user_age = int(input("Введите ваш возраст: "))
# 2. Сбор данных
# # Запрос веса (в кг) и сохранение в user_weight (тип float)
user_weight = float(input("Введите ваш вес (в кг): "))
# Запрос роста (в метрах, например 1.75) и сохранение в user_height (тип float)
user_height = float(input("Введите ваш рост (в метрах, например 1.75): "))
# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Рассчет bmi: вес разделить на рост в квадрате (Индекс массы тела)
bmi = user_weight / (user_height ** 2)
# округление до десятых
bmi = round (bmi, 1)
# Подсчет воды: вес * 30 мл и сохранение в water_needed
water_needed_ml = user_weight * 30
# перевод мл в л
water_needed_l = water_needed_ml / 1000
# 4. Вывод результата
# разделительная черта
print("-" * 35)
# вывод с использованием f строки
print(f"Отчет для пользователя: {user_name}")
# Вывод возраста, ИМТ (округленный до 1 знака) и нормы воды.
print(f"Возраст: {user_age} лет")
print(f"ИМТ: {bmi}")
print(f"Норма воды: {water_needed_l} литров в день")
# пространство (пустая строка)
print()
print("Расчет окончен. Будьте здоровы!")
print("-" * 35)